Catalogs/НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НоменклатурныеГруппы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДополнительныеСвойстваНоменклатурныхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойстваНоменклатурныхГрупп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НоменклатурныеГруппы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ДОРАБОТКА СУЩЕСТВУЮЩЕЙ ФОРМЫ СПРАВОЧНИКА НОМЕНКЛАТУРНЫЕГРУППЫ

&После("ПриСозданииНаСервере")
Процедура Расш_ПослеПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Скрываем поля для групп
	Если Объект.ЭтоГруппа Тогда
		Элементы.Площадь.Видимость = Ложь;
		Элементы.Использовать.Видимость = Ложь;
	КонецЕсли;
	
	// Загружаем значения из регистра
	Расш_ЗагрузитьЗначенияИзРегистра();
	
КонецПроцедуры

&После("ПередЗаписьюНаСервере")
Процедура Расш_ПослеПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем значения в регистр
	Если НЕ ТекущийОбъект.ЭтоГруппа И НЕ ТекущийОбъект.Ссылка.Пустая() Тогда
		// Передаём значения прямо из реквизитов объекта
		Расш_СохранитьЗначенияВРегистр(ТекущийОбъект.Ссылка, ТекущийОбъект.Площадь, ТекущийОбъект.Использовать);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Расш_ЗагрузитьЗначенияИзРегистра()
	
	// Для новых элементов или групп ничего не загружаем
	Если Объект.Ссылка.Пустая() ИЛИ Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСвойстваНоменклатурныхГрупп.Площадь,
	|	ДополнительныеСвойстваНоменклатурныхГрупп.Используется
	|ИЗ
	|	РегистрСведений.ДополнительныеСвойстваНоменклатурныхГрупп КАК ДополнительныеСвойстваНоменклатурныхГрупп
	|ГДЕ
	|	ДополнительныеСвойстваНоменклатурныхГрупп.НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
	
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		// Заполняем реквизиты объекта
		Объект.Площадь = Выборка.Площадь;
		Объект.Использовать = Выборка.Используется;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Расш_СохранитьЗначенияВРегистр(СсылкаНаОбъект, ЗначПлощадь, ЗначИспользовать)
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСвойстваНоменклатурныхГрупп.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НоменклатурнаяГруппа = СсылкаНаОбъект;
	МенеджерЗаписи.Площадь = ЗначПлощадь;
	МенеджерЗаписи.Используется = ЗначИспользовать;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
